In [5]:
import pandas as pd

df = pd.read_csv("weather_data.csv")

df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [15]:
student_data = {
    "name": ["Shifa Siddiqui","Sania","Anam","Mariyam"],
    "age": [22,21,20,19],
    "course": ["BSc Computer Science","BSC","Zoology","Botany"],
    "semester": [4,5,6,3],

    "is_student": True
}
df=pd.DataFrame(student_data)
df

             name  age                course  semester  is_student
0  Shifa Siddiqui   22  BSc Computer Science         4        True
1           Sania   21                   BSC         5        True
2            Anam   20               Zoology         6        True
3         Mariyam   19                Botany         3        True

In [17]:
df.tail(2)

      name  age   course  semester  is_student
2     Anam   20  Zoology         6        True
3  Mariyam   19   Botany         3        True

In [18]:
df[2:5]

      name  age   course  semester  is_student
2     Anam   20  Zoology         6        True
3  Mariyam   19   Botany         3        True

In [19]:
df.columns

Index(['name', 'age', 'course', 'semester', 'is_student'], dtype='object')

In [22]:
df.age

0    22
1    21
2    20
3    19
Name: age, dtype: int64

In [23]:
df = pd.read_csv("weather_data.csv")

In [24]:
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [25]:
#to print only few columns
df[['event','day']]

   event       day
0   Rain  1/1/2017
1  Sunny  1/2/2017
2   Snow  1/3/2017
3   Snow  1/4/2017
4   Rain  1/5/2017
5  Sunny  1/6/2017

In [30]:
#get the max temp
df.temperature.max()

35

In [31]:
df[df.temperature>=32]

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
4  1/5/2017           32          4   Rain

In [33]:
df[['day','temperature']][df.temperature==df.temperature.max()]

        day  temperature
1  1/2/2017           35

In [ ]:
#Set any column as index
df.set_index('day',inplace=True)

In [35]:
df

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [36]:
df.loc['1/6/2017']

temperature       31
windspeed          2
event          Sunny
Name: 1/6/2017, dtype: object

In [38]:
df.reset_index(inplace=True)
df

   index       day  temperature  windspeed  event
0      0  1/1/2017           32          6   Rain
1      1  1/2/2017           35          7  Sunny
2      2  1/3/2017           28          2   Snow
3      3  1/4/2017           24          7   Snow
4      4  1/5/2017           32          4   Rain
5      5  1/6/2017           31          2  Sunny